ibGraduateWork/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Деньги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.Деньги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ibGraduateWork/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>Метод</name>
    <type>
      <types>EnumRef.МетодыУчетнойПалитики</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ibGraduateWork/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ibGraduateWork/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВалюта</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

ibGraduateWork/src/Enums/МетодыУчетнойПалитики/МетодыУчетнойПалитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыУчетнойПалитики</name>
  <enumValues>
    <name>ЛИФО</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
</mdclass:Enum>

ibGraduateWork/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыНаСкладах</name>
        <description>Товары на складах</description>
        <code>41.01</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
      <childItems>
        <name>КассаОрганизации</name>
        <description>Касса организации</description>
        <code>50.01</code>
      </childItems>
      <childItems>
        <name>КассаОрганизацииВал</name>
        <description>Касса организации (в валюте)</description>
        <code>50.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>51</code>
    </items>
    <items>
      <name>ВалютныеСчета</name>
      <description>Валютные счета</description>
      <code>52</code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчикам</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>60.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамВыданным</name>
        <description>Расчеты по авансам выданным</description>
        <code>60.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПокупателямиИЗаказчиками</name>
      <description>Расчеты с покупателями и заказчиками</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПокупателями</name>
        <description>Расчеты с покупателями</description>
        <code>62.01</code>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамПолученным</name>
        <description>Расчеты по авансам полученным</description>
        <code>62.02</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>СебестоимостьПродаж</name>
        <description>Себестоимость продаж</description>
        <code>90.02</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

ibGraduateWork/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>DocumentRef.ПоступлениеТоваров</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СчетаОрганизации</types>
  </type>
  <predefined>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </items>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партия</name>
      <description>Партия</description>
      <code>000000006</code>
      <type>
        <types>DocumentRef.ПоступлениеТоваров</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СчетОрганизации</name>
      <description>Счет организации</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.СчетаОрганизации</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ibGraduateWork/src/Documents/РеализацияТоваров/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ДокументЗакупкиПродажиСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	МетодУчета = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(МоментВремени()).Метод;
	Если Не ЗначениеЗаполнено(МетодУчета) Тогда
		СервисКлиентСервер.СообщитьПользователю("Не установлена учетная политика. См. регистр ""Учетна политика"".", "Дата");
		Отказ = Истина;
	КонецЕсли;
	КоэффПеревода = СервисВызовСервера.ПолучитьКоэффициентПереводаВалютыВУчетнуюВалюту(Валюта, Дата, Истина, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Область ОперативныйУчет
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Номенклатура.Представление КАК Наименование,
		|	ВТ_Товары.Номенклатура.ВидНоменклатуры.Товар КАК ВидНоменклатурыТовар,
		|	ВТ_Товары.Количество КАК Количество,
		|	ОстаткиТоваровОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|		ПО ВТ_Товары.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиТоваровОстатки.Партия.МоментВремени УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток),
		|	СУММА(СтоимостьОстаток)
		|ПО
		|	Номенклатура";
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если МетодУчета = Перечисления.МетодыУчетнойПалитики.ФИФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УБЫВ", "ВОЗР");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.ВидНоменклатурыТовар Тогда
			Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
				СервисКлиентСервер.СообщитьПользователю(   
					?(ВыборкаНоменклатура.КоличествоОстаток = 0,
						//1
						"Ошибка ОУ: Товара """+ВыборкаНоменклатура.Наименование+""" нет в наличии на складе """+Склад.Наименование+""".",
						//2
						СтрШаблон("Ошибка ОУ: Товара ""%1"" недостаточно на складе ""%2"" в количестве: %3 шт.", 
							ВыборкаНоменклатура.Наименование, Склад.Наименование, ВыборкаНоменклатура.Количество-ВыборкаНоменклатура.КоличествоОстаток 
						)
					)//?
				);
				Отказ = Истина;
			КонецЕсли;
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоТовара = ВыборкаНоменклатура.Количество;
			Выборка = ВыборкаНоменклатура.Выбрать();
			Пока КоличествоТовара > 0 И Выборка.Следующий() Цикл
				Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Партия = Выборка.Партия;
				Движение.Номенклатура = Выборка.Номенклатура;
				
				Если КоличествоТовара >= Выборка.КоличествоОстаток Тогда
					Движение.Количество = Выборка.КоличествоОстаток;
					Движение.Стоимость = Выборка.СтоимостьОстаток;	
				Иначе 	
				    Движение.Количество = КоличествоТовара;
					Движение.Стоимость = Выборка.СтоимостьОстаток / Выборка.КоличествоОстаток * КоличествоТовара;
				КонецЕсли;
				КоличествоТовара = КоличествоТовара - Движение.Количество;	
			КонецЦикла;
			
		КонецЕсли;//Если ВыборкаНоменклатура.ВидНоменклатурыТовар 
		
	КонецЦикла;//Пока ВыборкаНоменклатура.Следующий()
	
    #КонецОбласти
	
	#Область БухгалтерскийУчет_СписаниеСебестоимости
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.Хозрасчетный.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Номенклатура.Представление КАК Наименование,
		|	ВТ_Товары.Номенклатура.ВидНоменклатуры.Товар КАК ВидТовар,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ХозрасчОстВсе.КоличествоОстатокДт, 0) КАК КолвоОстВсе,
		|	ЕСТЬNULL(ХозрасчОстВсе.СуммаОстатокДт, 0) КАК СуммаОстВсе,
		|	ХозрасчОстПоСклад.Субконто3 КАК Партия,
		|	ЕСТЬNULL(ХозрасчОстПоСклад.КоличествоОстатокДт, 0) КАК КолвоОстПартия
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&МоментВремени, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), &СписокСубконто, ) КАК ХозрасчОстВсе
		|		ПО ВТ_Товары.Номенклатура = ХозрасчОстВсе.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&МоментВремени, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), &СписокСубконто, Субконто2 = &Склад) КАК ХозрасчОстПоСклад
		|		ПО ВТ_Товары.Номенклатура = ХозрасчОстПоСклад.Субконто1
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(КолвоОстВсе),
		|	МАКСИМУМ(СуммаОстВсе),
		|	СУММА(КолвоОстПартия)
		|ПО
		|	Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	СписокСубконто = Новый Массив;
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Партия);
	Запрос.УстановитьПараметр("СписокСубконто", СписокСубконто);
	
	РезультатЗапроса = Запрос.Выполнить();
	//РезультатЗапроса.Выгрузить()
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.ВидТовар Тогда
		    Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КолвоОстПартия Тогда
				СервисКлиентСервер.СообщитьПользователю(   
					?(ВыборкаНоменклатура.КолвоОстПартия = 0,
						//1
						"Ошибка БУ: Товара """+ВыборкаНоменклатура.Наименование+""" нет в наличии на складе """+Склад.Наименование+""".",
						//2
						СтрШаблон("Ошибка БУ: Товара ""%1"" недостаточно на складе ""%2"" в количестве: %3 шт.", 
							ВыборкаНоменклатура.Наименование, Склад.Наименование, ВыборкаНоменклатура.Количество-ВыборкаНоменклатура.КолвоОстПартия 
						)
					)//?
				);
				Отказ = Истина;
			КонецЕсли;
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			КолвоТовара = ВыборкаНоменклатура.Количество;
			КолвоТовараОстаток = ВыборкаНоменклатура.КолвоОстВсе;
			СтоимостьТовараОстаток = ВыборкаНоменклатура.СуммаОстВсе;
			СтоимостьТовараСредняя = СтоимостьТовараОстаток / КолвоТовараОстаток;
			Выборка = ВыборкаНоменклатура.Выбрать();
			Пока КолвоТовара > 0 И Выборка.Следующий() Цикл 
				
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродаж;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
				Движение.Период = Дата;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Партия] = Выборка.Партия;
				
				Движение.КоличествоКт = мин(КолвоТовара, Выборка.КолвоОстПартия);
				Если Движение.КоличествоКт = КолвоТовараОстаток Тогда
					Движение.Сумма = СтоимостьТовараОстаток;	
				Иначе	
				    Движение.Сумма = Движение.КоличествоКт * СтоимостьТовараСредняя;
					КолвоТовараОстаток = КолвоТовараОстаток - Движение.КоличествоКт;
					СтоимостьТовараОстаток = СтоимостьТовараОстаток - Движение.Сумма;
				КонецЕсли;
				КолвоТовара = КолвоТовара - Движение.КоличествоКт;
				
			КонецЦикла;	
		
		КонецЕсли;// Если ВыборкаНоменклатура.ВидТовар
	КонецЦикла;// Пока ВыборкаНоменклатура.Следующий()
	#КонецОбласти
	 
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Выручка;
	Движение.Период = Дата;
	Движение.Сумма = ИтоговаяСумма * КоэффПеревода;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;

    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
